//
// Created by cactus on 14/11/2025.
//
// Напиши програма која ќе пресметува и анализира податоци за температури во повеќе градови во рамки на повеќе денови. Корисникот треба да внесе број на градови и број на денови за кои ќе се внесуваат температурите (температурите се реални броеви).
//
// Програмата треба да ги пресмета и испечати следните информации:
//
// - Просечната температура за секој град во формат како што е прикажан во примерот.
//
// - Редниот број на градот кој имал најниска просечна температура (градовите се нумерираат почнувајќи од реден број 1).
//
// - Вкупниот број на денови во било кој град во кои температурата била над 30°C (ако два града имаат температура над 30°C во ист ден, денот се брои два пати, односно вкупниот број на денови би бил 2).
#include <iostream>
using namespace std;

int main() {
    int n;
    int reversed;
    while (cin >> n) {
        int suma = 0;
        while (n >= 10) {
            int ld1 = n % 10;
            int ld2 = n / 10 % 10;
            suma = ld1 + ld2;
            // If suma is two-digit (≥10), append two digits
            // If suma is one-digit, append one digit
            if (suma >= 10) {
                reversed = (n / 100) * 100 + suma;
            } else {
                reversed = (n / 100) * 10 + suma;
            }
            cout << reversed << endl;
            n = reversed;
        }
    }
    return 0;
}
